{
   "class_name": "Model",
   "config": {
      "name": "ResNet",
      "layers": [
         {
            "class_name": "InputLayer",
            "config": {
               "batch_input_shape": [
                  null,
                  4096,
                  1
               ],
               "dtype": "float32",
               "sparse": false,
               "name": "input_2"
            },
            "name": "input_2",
            "inbound_nodes": []
         },
         {
            "class_name": "Conv1D",
            "config": {
               "name": "conv1d_34",
               "trainable": true,
               "dtype": "float32",
               "filters": 64,
               "kernel_size": [
                  16
               ],
               "strides": [
                  1
               ],
               "padding": "same",
               "data_format": "channels_last",
               "dilation_rate": [
                  1
               ],
               "activation": "linear",
               "use_bias": false,
               "kernel_initializer": "Mexh_filter",
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "kernel_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 0.0008999999845400453
                  }
               },
               "bias_regularizer": null,
               "activity_regularizer": null,
               "kernel_constraint": null,
               "bias_constraint": null
            },
            "name": "conv1d_34",
            "inbound_nodes": [
               [
                  [
                     "input_2",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Conv1D",
            "config": {
               "name": "conv1d_36",
               "trainable": true,
               "dtype": "float32",
               "filters": 64,
               "kernel_size": [
                  16
               ],
               "strides": [
                  1
               ],
               "padding": "same",
               "data_format": "channels_last",
               "dilation_rate": [
                  1
               ],
               "activation": "linear",
               "use_bias": false,
               "kernel_initializer": "Laplace_filter",
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "kernel_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 0.0008999999845400453
                  }
               },
               "bias_regularizer": null,
               "activity_regularizer": null,
               "kernel_constraint": null,
               "bias_constraint": null
            },
            "name": "conv1d_36",
            "inbound_nodes": [
               [
                  [
                     "input_2",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "BatchNormalization",
            "config": {
               "name": "batch_normalization_30",
               "trainable": true,
               "dtype": "float32",
               "axis": [
                  2
               ],
               "momentum": 0.9,
               "epsilon": 2.3e-05,
               "center": true,
               "scale": true,
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "beta_regularizer": null,
               "gamma_regularizer": null,
               "beta_constraint": null,
               "gamma_constraint": null
            },
            "name": "batch_normalization_30",
            "inbound_nodes": [
               [
                  [
                     "conv1d_34",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "BatchNormalization",
            "config": {
               "name": "batch_normalization_31",
               "trainable": true,
               "dtype": "float32",
               "axis": [
                  2
               ],
               "momentum": 0.9,
               "epsilon": 2.3e-05,
               "center": true,
               "scale": true,
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "beta_regularizer": null,
               "gamma_regularizer": null,
               "beta_constraint": null,
               "gamma_constraint": null
            },
            "name": "batch_normalization_31",
            "inbound_nodes": [
               [
                  [
                     "conv1d_36",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Add",
            "config": {
               "name": "add_10",
               "trainable": true,
               "dtype": "float32"
            },
            "name": "add_10",
            "inbound_nodes": [
               [
                  [
                     "batch_normalization_30",
                     0,
                     0,
                     {}
                  ],
                  [
                     "batch_normalization_31",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Activation",
            "config": {
               "name": "activation_30",
               "trainable": true,
               "dtype": "float32",
               "activation": "relu"
            },
            "name": "activation_30",
            "inbound_nodes": [
               [
                  [
                     "add_10",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "ZeroPadding1D",
            "config": {
               "name": "zero_padding1d_1",
               "trainable": true,
               "dtype": "float32",
               "padding": [
                  1,
                  1
               ]
            },
            "name": "zero_padding1d_1",
            "inbound_nodes": [
               [
                  [
                     "activation_30",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "MaxPooling1D",
            "config": {
               "name": "max_pooling1d_1",
               "trainable": true,
               "dtype": "float32",
               "strides": [
                  2
               ],
               "pool_size": [
                  3
               ],
               "padding": "valid",
               "data_format": "channels_last"
            },
            "name": "max_pooling1d_1",
            "inbound_nodes": [
               [
                  [
                     "zero_padding1d_1",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Conv1D",
            "config": {
               "name": "conv1d_38",
               "trainable": true,
               "dtype": "float32",
               "filters": 32,
               "kernel_size": [
                  1
               ],
               "strides": [
                  1
               ],
               "padding": "valid",
               "data_format": "channels_last",
               "dilation_rate": [
                  1
               ],
               "activation": "linear",
               "use_bias": false,
               "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                     "seed": null
                  }
               },
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "kernel_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "bias_regularizer": null,
               "activity_regularizer": null,
               "kernel_constraint": null,
               "bias_constraint": null
            },
            "name": "conv1d_38",
            "inbound_nodes": [
               [
                  [
                     "max_pooling1d_1",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "BatchNormalization",
            "config": {
               "name": "batch_normalization_32",
               "trainable": true,
               "dtype": "float32",
               "axis": [
                  2
               ],
               "momentum": 0.9,
               "epsilon": 2.3e-05,
               "center": true,
               "scale": true,
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "beta_regularizer": null,
               "gamma_regularizer": null,
               "beta_constraint": null,
               "gamma_constraint": null
            },
            "name": "batch_normalization_32",
            "inbound_nodes": [
               [
                  [
                     "conv1d_38",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Activation",
            "config": {
               "name": "activation_31",
               "trainable": true,
               "dtype": "float32",
               "activation": "relu"
            },
            "name": "activation_31",
            "inbound_nodes": [
               [
                  [
                     "batch_normalization_32",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Conv1D",
            "config": {
               "name": "conv1d_39",
               "trainable": true,
               "dtype": "float32",
               "filters": 32,
               "kernel_size": [
                  3
               ],
               "strides": [
                  1
               ],
               "padding": "same",
               "data_format": "channels_last",
               "dilation_rate": [
                  1
               ],
               "activation": "linear",
               "use_bias": false,
               "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                     "seed": null
                  }
               },
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "kernel_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "bias_regularizer": null,
               "activity_regularizer": null,
               "kernel_constraint": null,
               "bias_constraint": null
            },
            "name": "conv1d_39",
            "inbound_nodes": [
               [
                  [
                     "activation_31",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "BatchNormalization",
            "config": {
               "name": "batch_normalization_33",
               "trainable": true,
               "dtype": "float32",
               "axis": [
                  2
               ],
               "momentum": 0.9,
               "epsilon": 2.3e-05,
               "center": true,
               "scale": true,
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "beta_regularizer": null,
               "gamma_regularizer": null,
               "beta_constraint": null,
               "gamma_constraint": null
            },
            "name": "batch_normalization_33",
            "inbound_nodes": [
               [
                  [
                     "conv1d_39",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Activation",
            "config": {
               "name": "activation_32",
               "trainable": true,
               "dtype": "float32",
               "activation": "relu"
            },
            "name": "activation_32",
            "inbound_nodes": [
               [
                  [
                     "batch_normalization_33",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Conv1D",
            "config": {
               "name": "conv1d_40",
               "trainable": true,
               "dtype": "float32",
               "filters": 128,
               "kernel_size": [
                  1
               ],
               "strides": [
                  1
               ],
               "padding": "valid",
               "data_format": "channels_last",
               "dilation_rate": [
                  1
               ],
               "activation": "linear",
               "use_bias": false,
               "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                     "seed": null
                  }
               },
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "kernel_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "bias_regularizer": null,
               "activity_regularizer": null,
               "kernel_constraint": null,
               "bias_constraint": null
            },
            "name": "conv1d_40",
            "inbound_nodes": [
               [
                  [
                     "activation_32",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "BatchNormalization",
            "config": {
               "name": "batch_normalization_34",
               "trainable": true,
               "dtype": "float32",
               "axis": [
                  2
               ],
               "momentum": 0.9,
               "epsilon": 2.3e-05,
               "center": true,
               "scale": true,
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "beta_regularizer": null,
               "gamma_regularizer": null,
               "beta_constraint": null,
               "gamma_constraint": null
            },
            "name": "batch_normalization_34",
            "inbound_nodes": [
               [
                  [
                     "conv1d_40",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Activation",
            "config": {
               "name": "activation_33",
               "trainable": true,
               "dtype": "float32",
               "activation": "relu"
            },
            "name": "activation_33",
            "inbound_nodes": [
               [
                  [
                     "batch_normalization_34",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Conv1D",
            "config": {
               "name": "conv1d_41",
               "trainable": true,
               "dtype": "float32",
               "filters": 128,
               "kernel_size": [
                  1
               ],
               "strides": [
                  1
               ],
               "padding": "valid",
               "data_format": "channels_last",
               "dilation_rate": [
                  1
               ],
               "activation": "linear",
               "use_bias": false,
               "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                     "seed": null
                  }
               },
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "kernel_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "bias_regularizer": null,
               "activity_regularizer": null,
               "kernel_constraint": null,
               "bias_constraint": null
            },
            "name": "conv1d_41",
            "inbound_nodes": [
               [
                  [
                     "max_pooling1d_1",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Add",
            "config": {
               "name": "add_11",
               "trainable": true,
               "dtype": "float32"
            },
            "name": "add_11",
            "inbound_nodes": [
               [
                  [
                     "activation_33",
                     0,
                     0,
                     {}
                  ],
                  [
                     "conv1d_41",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Conv1D",
            "config": {
               "name": "conv1d_42",
               "trainable": true,
               "dtype": "float32",
               "filters": 32,
               "kernel_size": [
                  1
               ],
               "strides": [
                  1
               ],
               "padding": "valid",
               "data_format": "channels_last",
               "dilation_rate": [
                  1
               ],
               "activation": "linear",
               "use_bias": false,
               "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                     "seed": null
                  }
               },
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "kernel_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "bias_regularizer": null,
               "activity_regularizer": null,
               "kernel_constraint": null,
               "bias_constraint": null
            },
            "name": "conv1d_42",
            "inbound_nodes": [
               [
                  [
                     "add_11",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "BatchNormalization",
            "config": {
               "name": "batch_normalization_35",
               "trainable": true,
               "dtype": "float32",
               "axis": [
                  2
               ],
               "momentum": 0.9,
               "epsilon": 2.3e-05,
               "center": true,
               "scale": true,
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "beta_regularizer": null,
               "gamma_regularizer": null,
               "beta_constraint": null,
               "gamma_constraint": null
            },
            "name": "batch_normalization_35",
            "inbound_nodes": [
               [
                  [
                     "conv1d_42",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Activation",
            "config": {
               "name": "activation_34",
               "trainable": true,
               "dtype": "float32",
               "activation": "relu"
            },
            "name": "activation_34",
            "inbound_nodes": [
               [
                  [
                     "batch_normalization_35",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Conv1D",
            "config": {
               "name": "conv1d_43",
               "trainable": true,
               "dtype": "float32",
               "filters": 32,
               "kernel_size": [
                  3
               ],
               "strides": [
                  1
               ],
               "padding": "same",
               "data_format": "channels_last",
               "dilation_rate": [
                  1
               ],
               "activation": "linear",
               "use_bias": false,
               "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                     "seed": null
                  }
               },
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "kernel_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "bias_regularizer": null,
               "activity_regularizer": null,
               "kernel_constraint": null,
               "bias_constraint": null
            },
            "name": "conv1d_43",
            "inbound_nodes": [
               [
                  [
                     "activation_34",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "BatchNormalization",
            "config": {
               "name": "batch_normalization_36",
               "trainable": true,
               "dtype": "float32",
               "axis": [
                  2
               ],
               "momentum": 0.9,
               "epsilon": 2.3e-05,
               "center": true,
               "scale": true,
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "beta_regularizer": null,
               "gamma_regularizer": null,
               "beta_constraint": null,
               "gamma_constraint": null
            },
            "name": "batch_normalization_36",
            "inbound_nodes": [
               [
                  [
                     "conv1d_43",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Activation",
            "config": {
               "name": "activation_35",
               "trainable": true,
               "dtype": "float32",
               "activation": "relu"
            },
            "name": "activation_35",
            "inbound_nodes": [
               [
                  [
                     "batch_normalization_36",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Conv1D",
            "config": {
               "name": "conv1d_44",
               "trainable": true,
               "dtype": "float32",
               "filters": 128,
               "kernel_size": [
                  1
               ],
               "strides": [
                  1
               ],
               "padding": "valid",
               "data_format": "channels_last",
               "dilation_rate": [
                  1
               ],
               "activation": "linear",
               "use_bias": false,
               "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                     "seed": null
                  }
               },
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "kernel_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "bias_regularizer": null,
               "activity_regularizer": null,
               "kernel_constraint": null,
               "bias_constraint": null
            },
            "name": "conv1d_44",
            "inbound_nodes": [
               [
                  [
                     "activation_35",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "BatchNormalization",
            "config": {
               "name": "batch_normalization_37",
               "trainable": true,
               "dtype": "float32",
               "axis": [
                  2
               ],
               "momentum": 0.9,
               "epsilon": 2.3e-05,
               "center": true,
               "scale": true,
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "beta_regularizer": null,
               "gamma_regularizer": null,
               "beta_constraint": null,
               "gamma_constraint": null
            },
            "name": "batch_normalization_37",
            "inbound_nodes": [
               [
                  [
                     "conv1d_44",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Activation",
            "config": {
               "name": "activation_36",
               "trainable": true,
               "dtype": "float32",
               "activation": "relu"
            },
            "name": "activation_36",
            "inbound_nodes": [
               [
                  [
                     "batch_normalization_37",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Add",
            "config": {
               "name": "add_12",
               "trainable": true,
               "dtype": "float32"
            },
            "name": "add_12",
            "inbound_nodes": [
               [
                  [
                     "activation_36",
                     0,
                     0,
                     {}
                  ],
                  [
                     "add_11",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Conv1D",
            "config": {
               "name": "conv1d_45",
               "trainable": true,
               "dtype": "float32",
               "filters": 32,
               "kernel_size": [
                  1
               ],
               "strides": [
                  1
               ],
               "padding": "valid",
               "data_format": "channels_last",
               "dilation_rate": [
                  1
               ],
               "activation": "linear",
               "use_bias": false,
               "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                     "seed": null
                  }
               },
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "kernel_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "bias_regularizer": null,
               "activity_regularizer": null,
               "kernel_constraint": null,
               "bias_constraint": null
            },
            "name": "conv1d_45",
            "inbound_nodes": [
               [
                  [
                     "add_12",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "BatchNormalization",
            "config": {
               "name": "batch_normalization_38",
               "trainable": true,
               "dtype": "float32",
               "axis": [
                  2
               ],
               "momentum": 0.9,
               "epsilon": 2.3e-05,
               "center": true,
               "scale": true,
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "beta_regularizer": null,
               "gamma_regularizer": null,
               "beta_constraint": null,
               "gamma_constraint": null
            },
            "name": "batch_normalization_38",
            "inbound_nodes": [
               [
                  [
                     "conv1d_45",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Activation",
            "config": {
               "name": "activation_37",
               "trainable": true,
               "dtype": "float32",
               "activation": "relu"
            },
            "name": "activation_37",
            "inbound_nodes": [
               [
                  [
                     "batch_normalization_38",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Conv1D",
            "config": {
               "name": "conv1d_46",
               "trainable": true,
               "dtype": "float32",
               "filters": 32,
               "kernel_size": [
                  3
               ],
               "strides": [
                  1
               ],
               "padding": "same",
               "data_format": "channels_last",
               "dilation_rate": [
                  1
               ],
               "activation": "linear",
               "use_bias": false,
               "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                     "seed": null
                  }
               },
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "kernel_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "bias_regularizer": null,
               "activity_regularizer": null,
               "kernel_constraint": null,
               "bias_constraint": null
            },
            "name": "conv1d_46",
            "inbound_nodes": [
               [
                  [
                     "activation_37",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "BatchNormalization",
            "config": {
               "name": "batch_normalization_39",
               "trainable": true,
               "dtype": "float32",
               "axis": [
                  2
               ],
               "momentum": 0.9,
               "epsilon": 2.3e-05,
               "center": true,
               "scale": true,
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "beta_regularizer": null,
               "gamma_regularizer": null,
               "beta_constraint": null,
               "gamma_constraint": null
            },
            "name": "batch_normalization_39",
            "inbound_nodes": [
               [
                  [
                     "conv1d_46",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Activation",
            "config": {
               "name": "activation_38",
               "trainable": true,
               "dtype": "float32",
               "activation": "relu"
            },
            "name": "activation_38",
            "inbound_nodes": [
               [
                  [
                     "batch_normalization_39",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Conv1D",
            "config": {
               "name": "conv1d_47",
               "trainable": true,
               "dtype": "float32",
               "filters": 128,
               "kernel_size": [
                  1
               ],
               "strides": [
                  1
               ],
               "padding": "valid",
               "data_format": "channels_last",
               "dilation_rate": [
                  1
               ],
               "activation": "linear",
               "use_bias": false,
               "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                     "seed": null
                  }
               },
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "kernel_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "bias_regularizer": null,
               "activity_regularizer": null,
               "kernel_constraint": null,
               "bias_constraint": null
            },
            "name": "conv1d_47",
            "inbound_nodes": [
               [
                  [
                     "activation_38",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "BatchNormalization",
            "config": {
               "name": "batch_normalization_40",
               "trainable": true,
               "dtype": "float32",
               "axis": [
                  2
               ],
               "momentum": 0.9,
               "epsilon": 2.3e-05,
               "center": true,
               "scale": true,
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "beta_regularizer": null,
               "gamma_regularizer": null,
               "beta_constraint": null,
               "gamma_constraint": null
            },
            "name": "batch_normalization_40",
            "inbound_nodes": [
               [
                  [
                     "conv1d_47",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Activation",
            "config": {
               "name": "activation_39",
               "trainable": true,
               "dtype": "float32",
               "activation": "relu"
            },
            "name": "activation_39",
            "inbound_nodes": [
               [
                  [
                     "batch_normalization_40",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Add",
            "config": {
               "name": "add_13",
               "trainable": true,
               "dtype": "float32"
            },
            "name": "add_13",
            "inbound_nodes": [
               [
                  [
                     "activation_39",
                     0,
                     0,
                     {}
                  ],
                  [
                     "add_12",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Conv1D",
            "config": {
               "name": "conv1d_48",
               "trainable": true,
               "dtype": "float32",
               "filters": 64,
               "kernel_size": [
                  1
               ],
               "strides": [
                  1
               ],
               "padding": "valid",
               "data_format": "channels_last",
               "dilation_rate": [
                  1
               ],
               "activation": "linear",
               "use_bias": false,
               "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                     "seed": null
                  }
               },
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "kernel_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "bias_regularizer": null,
               "activity_regularizer": null,
               "kernel_constraint": null,
               "bias_constraint": null
            },
            "name": "conv1d_48",
            "inbound_nodes": [
               [
                  [
                     "add_13",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "BatchNormalization",
            "config": {
               "name": "batch_normalization_41",
               "trainable": true,
               "dtype": "float32",
               "axis": [
                  2
               ],
               "momentum": 0.9,
               "epsilon": 2.3e-05,
               "center": true,
               "scale": true,
               "beta_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "gamma_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "moving_mean_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "moving_variance_initializer": {
                  "class_name": "Ones",
                  "config": {}
               },
               "beta_regularizer": null,
               "gamma_regularizer": null,
               "beta_constraint": null,
               "gamma_constraint": null
            },
            "name": "batch_normalization_41",
            "inbound_nodes": [
               [
                  [
                     "conv1d_48",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Activation",
            "config": {
               "name": "activation_40",
               "trainable": true,
               "dtype": "float32",
               "activation": "relu"
            },
            "name": "activation_40",
            "inbound_nodes": [
               [
                  [
                     "batch_normalization_41",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "Conv1D",
            "config": {
               "name": "conv1d_49",
               "trainable": true,
               "dtype": "float32",
               "filters": 64,
               "kernel_size": [
                  3
               ],
               "strides": [
                  2
               ],
               "padding": "same",
               "data_format": "channels_last",
               "dilation_rate": [
                  1
               ],
               "activation": "linear",
               "use_bias": false,
               "kernel_initializer": {
                  "class_name": "GlorotUniform",
                  "config": {
                     "seed": null
                  }
               },
               "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
               },
               "kernel_regularizer": {
                  "class_name": "L1L2",
                  "config": {
                     "l1": 0.0,
                     "l2": 9.999999747378752e-05
                  }
               },
               "bias_regularizer": null,
               "activity_regularizer": null,
               "kernel_constraint": null,
               "bias_constraint": null
            },
            "name": "conv1d_49",
            "inbound_nodes": [
               [
                  [
                     "activation_40",
                     0,
                     0,
                     {}
                  ]
               ]
            ]
         },
         {
            "class_name": "BatchNormalization",
            "config": {
               "name": "batch_normalization_42",
               "trainable": true,
